app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    @movies = Movie.all
    @sort = params[:sort]
    @ratings = params[:ratings]

    @selected_ratings = @all_ratings
    if @ratings.nil?

      @movies = Movie.order(@sort)
    else
      @selected_ratings = @ratings.keys
      @movies = Movie.order(@sort).where(:rating => @ratings.keys)
---
SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')  ORDER BY release_date